using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Deck
{   public BigAkanaCard[] BigAkanas = new BigAkanaCard [22];
    public Deck(){
        // 愚者
        BigAkanas[0] = new BigAkanaCard("愚者",new string[]{"开始","自由","天真","流浪","大胆","旅行"},Star.Uranus,Element.Wind,"愚人是一个不受世俗规范约束的人，所以这张牌代表了自我。它暗示你虽然活在尘世中，但仍然有一颗纯洁的相信梦想的童心",
        new string[]{"好冒险、寻梦人、不拘泥于传统的观念、自由奔放、一切从基础出发、四处流浪",
        "自由恋爱、不顾及他人看法、以独特的方式获得成功、轻易坠入爱河、浪漫多彩的爱情、独特的恋人、等待交往机会",
        "热衷于事业或血液，以独特的方式获得意外的收获、由于好奇心对当前的学业产生浓厚的兴趣、把握重点、寻求捷径、倾向于自由的工作氛围、适合艺术类工作或从事自由职业",
        "以轻松的方式交友、于旅途中结交新朋友，因彰显个性而受到他人欢迎、投资上孤注一掷不计后果",
        "寻求独特的保健之法、彰显自我的着装方式，适合休闲装或运动装",
        "没有目的的旅行、憧憬自然的地方、毫无目的地前行、喜欢尝试挑战新鲜事物、四处流浪"
        },new string[]{"情绪低落、遭受失败、漫无目的的四处流浪、行为散漫、愚昧的行动。",
        "心情空虚、轻率的恋情、无法长久持续的融洽感、不安的爱情的旅程、对婚姻感到束缚、彼此忽冷忽热、不顾众人反对坠入爱河、为恋人的负心所伤、感情不专一",
        "成绩一落千丈，没有耐心，行事缺乏计划，经常迟到，猜题错误导致考试失利、考前突击无法为你带来太大效果",
        "因过于单纯被他人轻视、被旁人视为怪胎、言行怪癖不合常理、粗心大意、行事无节制、缺乏理财观念、愿望难以达成、收入逐渐趋于稳定、财务操作毫无计划",
        "不重视自身健康、生活不规律、因贪玩影响健康",
        "旅途中断、兴趣广泛、不脚踏实地、无视旁人眼光、冲动行事、行事不检点"});

        // 魔术师
        BigAkanas[1] = new BigAkanaCard("魔术师",new string[]{"观察","开始","创造"},Star.Mercury,Element.Wind,"这张牌充满了开创性和神奇的力量，变化莫测。一切都在你的手中，成功将获得巨大的收获，失败也是在一念之间，所以有大悲大喜的意味。",
        new string[]{
            "受好奇心驱使展开调查研究、具有独创性、具备发展潜力、展开新的计划并获得成功，幸福的开始",
            "心有灵犀一点通、新恋情的展开、备受异性欢迎、彼此配合默契、品尝爱情的喜悦、轻率地交往、变更约会地点的方式可以令彼此保持新鲜感",
            "以新的方式读书获得好的成绩、事物处理得当、高效计划、注重细节、能够充分发挥自己所学、创意得到旁人认同、适合艺术方面的工作、喜欢充满创新的工作、适合从事技术人员、播音员、大众传媒等相关工作或艺术设计工作",
            "结交更多的朋友、寻得良师益友、寻得彼此互补的合作对象、能够以合理的代价获得想要的东西",
            "精神状态稳定、适合知性的装扮",
            "喜欢阅读并从中获得知识和快乐、可能会有短期的旅行、对语言学习颇有兴趣、适合郊外野餐、拥有敏捷的运动神经、适合参加辩论会、善于模仿并因此获益、处事机灵善变、事事顺利"
        },
        new string[]{
            "犹豫不决、因学艺不精而败北、看待事物过于消极、易受骗上当、遇事光说不练",
            "不善于向对方表白、缺乏爱情技巧、易受花言巧语者蒙骗、对爱情无法专心、心情过于浮躁、冷酷无情、无法向对方表达心意",
            "预期的成绩没有起色,努力不足、谎言被拆穿、需要改变学习方法、考试失误、成绩退步、工作一成不变",
            "因态度不明确失信于人、虚假的表面敷衍、不够体贴对方、遭遇欺诈、容易乱花钱、因好赌倾家荡产",
            "精神紧张需要休息、情绪暴躁容易激动、呼吸器官或大脑负荷过重、着装不搭调",
            "旅行计划取消、遭遇交通堵塞、因懦弱造成竞技失败，不听他人劝告"
        });
        
        // 女教皇
        BigAkanas[2] = new BigAkanaCard("女教皇",  // card Name
                new string[]{"等待","智慧","理性","消极","静止"}, // card Keywords
                Star.Moon, // card Star
                Element.Water, // card Element
                "代表精神和心灵发展，不代表具体事务而代表可能性。你应该像内心搜索，一切困惑的答案就在你的心中。对立是事态使她重新自我反省，并使她在反省中找到自己真实的力量；交流是她得到新的直觉与洞察力，能够在思考一些重要问题时清楚分析每个步骤，了解到未来的发展和自己的不足", // card descripyion
                new string[]{ // card upright
                    "有良知的、文静的、知性的、具备敏锐洞察力、理性的、富有研究精神、有正确的时机或人将出现的预感",
                    "理智的感情生活、柏拉图式的恋情、精神方面的结合、能够消除烦恼的对象、深藏内心的爱意、介于友人与恋人之间的关系、以诗篇或文章来表达爱意",
                    "富有责任感、目标明确、苦心钻研、拥有展现自身潜力的机会、求知欲旺盛、考运佳、具备评论才能、适合从事与教育相关的职业",
                    "能互相谅解的只有、良好的商洽对象、能够交新的朋友、体贴的好友、理性消费、善于理财",
                    "着装朴素简介、善待身体、注重自身卫生、体力出众且深藏不露",
                    "制作手工艺品、知性的娱乐方式、脑力游戏、无需外出的活动方式、出众的理解力、同冷静的女性商洽可获新知、善于洞悉他人",
                },
                new string[]{ // card reversed
                    "缺乏理性思维能力、粗心大意、因精神压抑而歇斯底里、易紧张、神经质、意气用事",
                    "恋情以单相思告终、面对心仪的对象裹足不前、因洁癖错过爱情、憧憬单身生活、因冷漠而产生误会、任性妄为、晚婚、无趣的女性",
                    "固执、不能集中全力、认知肤浅、不喜用功、无法学以致用、因状态低落感到焦虑、考试失利、犹豫不决以致于错过良机",
                    "受到冷落对待、应留心被人重伤、自闭、易因过于激动而得罪人、无计划的消费、浪费成性",
                    "精神紧张、不孕症、歇斯底里、错误的减肥计划、贫血、手脚冰凉、心情不佳、因任性而倍感孤独、嘲笑他人、心胸狭隘",
                    "无心读书、吵闹的环境使得身心倍感疲惫",
        });
        // card finished

        // new card
        BigAkanas[3] = new BigAkanaCard("女皇",  // card Name
                new string[]{"高贵","热情","丰收"}, // card Keywords
                Star.Venus, // card Star
                Element.Earth, // card Element
                "这是一张对感情描述十分积极的派，女皇是完美到极致的女性，是孕育大地的母亲，她主管着生命的诞生、孕育和大地的丰收。她象征幸福的爱情、优越的物质与满足的生活，同时也警告人们过于安逸的生活将导致奢侈和懈怠。她是在有形世界中心灵层面的显现，象征创造力和聪明才智，是渴望和梦想的化身。拥有这张牌的人无论在事业上还是感情上都坚持脚踏实地，并得到事业上的成功和充实的感情生活，踊跃的创新思维和杰出的思考能力使他们始终站在社会进步的前列", // card descripyion
                new string[]{ // card upright
                    "优雅的生活、有艺术天分、丰收、繁荣昌盛、富足、善于营造气氛",
                    "有收获的恋情、谈婚论嫁、成为异性瞩目的焦点、轻松的交往、令男性钦佩的女强人、富有母性光辉",
                    "成绩进步、考试成绩优秀、在艺术领域颇有收获、适合服装服饰相关行业、体面的工作、女强人",
                    "因性格开朗赢得旁人好感、受人瞩目、成为聚会或派对的主角、获得意外之财",
                    "体力充沛、多产、气质佳、风度翩翩、对时尚服饰颇为喜爱",
                    "喜爱逛街购物、喜爱交游派对等集体活动",
                },
                new string[]{ // card reversed
                    "困惑、缺乏上进心、轻浮、损失、爱慕虚荣",
                    "优柔寡断、没有结果的恋情、因任性妄为令人厌恶、妒火中烧、沉迷恋情无法自拔、缺乏女人味、婚姻遥不可及、沉溺肉欲之中、意外怀孕",
                    "弄丢他人笔记、浪费时间、懒惰、对学科过于好恶分明、成绩低落、注意力无法集中",
                    "锋芒毕露、过于好面逞强、过于骄纵、包容力欠缺、被他人轻视、爱慕虚荣、浪费成性、投资过剩、不必要的花费",
                    "体型过胖、饮食过度、不适宜浓妆艳抹、多余的装饰",
                    "处事犹豫不决、爱好颇多无一从重、谈吐轻浮、金玉其外败絮其中",
        });
        // card finished

        // new card
        BigAkanas[4] = new BigAkanaCard("皇帝",  // card Name
                new string[]{"权力","威严","支配"}, // card Keywords
                Star.Aries, // card Star
                Element.Fire, // card Element
                "男性权威的象征，威严的外表后有亲切的心。他充满热情，愿意与求教的人分享他的成功秘诀。他的秘诀就是依靠头脑，以及过去努力奋斗时所积累的经验。他的建议也多来自那些宝贵的经验，正如他正直的人格一样值得你信赖", // card descripyion
                new string[]{ // card upright
                    "魄力十足、万众瞩目、出众的领导才能、基本功扎实、男性化、富有责任感、充满阳刚之气",
                    "因锲而不舍的景深获得青睐、值得信赖的年长对象、值得依靠的、心系恋人、好恶分明的矫枉、主动追求爱情、有主动交往的倾向",
                    "锲而不舍的钻研学业、保持优良的水准、目标过高、信念坚定、理性的、考试顺利、善于管理、乐于助人、适合从政",
                    "活跃的领导者、成为他人商洽的对象、可信赖的朋友学长、结交权贵、对现有财富感到满足",
                    "身体健康、对于自身健康充满信心、适合佩戴一些小饰品以愉悦心情",
                    "适合和朋友一起外出旅游、个性坚定永不言败、坚韧不拔的性格",
                },
                new string[]{ // card reversed
                    "幼稚、缺乏管理能力、不负责任、任性妄为、蛮横霸道、寡欲",
                    "强迫的恋情、不可靠的对象、无法告白心事、华而不实的恋情、痛苦的结局",
                    "不适合久坐工作、缺乏干劲、缺乏领导能力、因过于自信而败北、需要从根本检讨以求反败为胜、从头再来",
                    "因不负责任被人指责、固执己见、蛮横霸道以致被人厌恶、无法领导他人、死薪水、损失金钱、财务障碍、预算不足",
                    "过分相信偏方治大病、不适宜从事过于激烈的运动",
                    "无法对任何活动感到兴趣、虚张声势、自以为是",
        });
        // card finished

        // new card
        BigAkanas[5] = new BigAkanaCard("教皇",  // card Name
                new string[]{"宗教","传统","援助","仪式"}, // card Keywords
                Star.Taurus, // card Star
                Element.Earth, // card Element
                "以慈悲与洞察力试图拯救世人的灵魂，并用自己的言论引导人们走向正途。然而需要注意的是他同时也是传统知识和保守道德的代表，他控制人们的思维，使人的眼界变得狭小。只有彻底放弃陈旧的一切，探索新的解决方式，可能才有希望", // card descripyion
                new string[]{ // card upright
                    "值得信赖的、得到援助的、良好的建言者、有贡献的、心胸宽广的、有宗教情绪的",
                    "值得信赖的恋人、对恋情持谨慎态度，博爱、婚嫁、良缘、有媒人牵线搭桥、能够安全交往的对象、年长的异性、逐渐加深的感情、长久持续的交往",
                    "多听他人的劝告、遇到良师致使成绩进步、会出现对自己有帮助的人、与学长或同学一起用功而获益、耐力十足、思想保守、适合顾问或医学工作以及以谈话为主的工作",
                    "获得学长的建言、获得父母的资助、事事为朋友着想、容易遗失钱包",
                    "有遇到好医生的机会、化妆时偏重于嘴唇会带来好运、口红适合粉色系",
                    "观赏音乐会或看电影、前往寺庙上香许愿、拥抱自然",
                },
                new string[]{ // card reversed
                    "失去信赖、多管闲事、过于依赖他人、心胸狭隘、被强迫推销、孤立无援",
                    "缘分浅薄、步调缓慢、彼此不够体贴、占有欲过重、因固执己见令人反感、父母反对",
                    "因轻视而品尝苦果、因厌恶老师对课业失去兴趣、过分依赖同学的笔记、得到错误的情报",
                    "干涉他人、令人困扰的好意、自以为是、没有必要的义气、因助人而损失金钱、无人援助",
                    "要多运动、呼吸道疾病、频咳、偏食",
                    "恐高、喜清净、不宜乘坐飞机旅行",
        });
        // card finished

        // new card
        BigAkanas[6] = new BigAkanaCard("恋人",  // card Name
                new string[]{"选择","爱情","性","结合","罗曼蒂克"}, // card Keywords
                Star.Gemini, // card Star
                Element.Wind, // card Element
                "这是塔罗牌中解释爱情最好的一张牌，它代表着人生的青春期。今广阳光普照，充满了幸福的感受，但恋人的后面却有着许多考验在等着他们——希望之树和毒蛇盘踞的苹果之树。恋爱中的情侣可以彼此协助、支持，浪漫成了这段美好时光的主题。但恋爱中的人必须面对感情上的抉择，就是在众多的异性中选择其中的一个作为伴侣，所以说爱情是美丽又残酷的。在解牌时一定要注意“结合”背后的“选择”，有所取舍", // card descripyion
                new string[]{ // card upright
                    "幸福的乡遇、同心协力、情投意合、感情丰富、前途光明、坠入爱河、整理思绪",
                    "在团体活动中结识进而结为连理、经友人介绍相识相恋、步入结婚殿堂、由朋友成为恋人、自由愉快的交往",
                    "遇到决定前途的大好机会、以团队协作获得成功、敏锐的观察力、出现好帮手、喜欢的科目成绩优异、擅长文科或艺术类的科目、因互学互助成绩有所提高",
                    "没有财务烦恼，出现好伙伴、人际关系良好、社团活动顺利、朋友增加、易与他人亲近、活泼开朗幽默",
                    "多与好友抒怀畅谈有益缓解压力，着装缺少时尚元素",
                    "愉快的短暂旅行、愉快的郊游会带来好运",
                },
                new string[]{ // card reversed
                    "伤离别、关系结束、无助益、遭遇险阻、转移目标、兴趣无法持久、无精打采、表里不一、易受诱惑",
                    "关系冷淡、移情别恋、水性杨花、短暂的恋情、分手、无法赢得芳心",
                    "没有计划、不能持之以恒、缺乏注意力、光说不练、无心用功、学习效率地下、成绩不佳",
                    "开销大、资金短缺、破财、意气用事、朋友不助、意见不合、团队解散、交不到好朋友",
                    "因刺激性食物导致肠胃功能紊乱、化妆品过敏、经期不顺",
                    "见异思迁、遇事不能持之以恒、目标不明确、易受诱惑、笨拙、闷闷不乐、情绪萎靡不振",
        });
        // card finished

        // new card
        BigAkanas[7] = new BigAkanaCard("战车",  // card Name
                new string[]{"意志","自律","胜利","旅程","空虚"}, // card Keywords
                Star.Cancer, // card Star
                Element.Water, // card Element
                "这张牌描绘的是克服障碍，是强者的象征，它与力量息息相关，意味着由坚持而获得成功。无论前方有多少艰难险阻你都要继续走下去，同时也会由此掌握自己和周遭事物的命运", // card descripyion
                new string[]{ // card upright
                    "高效率、把握先机、以积极的心态面对事物、获得胜利、取得驾照、搬家",
                    "情场得意、恋情进展迅速、积极交往、大胆追求",
                    "独立工作、自信、迅速调整情绪以提高效率、竞争激烈、适合于娱乐相关的职业、成绩进步、考试及格过关",
                    "存款购车、交友广博、个性活泼、善于人际交往、独立自主",
                    "身体健康、活力充沛",
                    "适合户外活动、考上驾照、对新鲜事物充满兴趣、写日记",
                },
                new string[]{ // card reversed
                    "失控、发生意外、胡作非为、十败、止步不前、固执己见、注意力散漫、遇突发事件而不知所措",
                    "过于鲁莽、被抛弃、话不投机、因懦弱致使恋情无法进展、因话语直白伤人、遭遇强劲情敌",
                    "对无兴趣之事缺乏责任感、项目进展遇困、工作效率低下、对课业不感兴趣、成绩不佳、学习效率低下",
                    "损失金钱、不懂节制的花费、赌博失利，争论不断、因任性妄为引起他人不满、待人冷淡",
                    "身心疲惫、运动或意外受伤",
                    "固执己见、超速驾驶、注意力散漫、得意忘形、因遭遇突发事件而措手不及",
        });
        // card finished

        // new card
        BigAkanas[8] = new BigAkanaCard("力量",  // card Name
                new string[]{"力量","勇气","信心","耐心"}, // card Keywords
                Star.Leo, // card Star
                Element.Fire, // card Element
                "这是爱与坚强意志的象征。正是因为有了爱与意志，人类才能克服困难，在历史的长河中不断前进，此外它还意味着你有能力解决现在所面临的困难局面，并对自己内在的力量充满信心。解牌时要注意“刚柔并济”，人类的本能是恐惧，需要有理智来控制和安慰；但是又不能失去本能的动力，理智还要给予鼓励。由此可以看出“平衡”在塔罗牌的解释中是重要的", // card descripyion
                new string[]{ // card upright
                    "精力充沛、不屈不挠、意志坚定、潜力十足、胆识过人、信念坚定",
                    "过于热情、获得恋情、克服障碍延续爱情、在恋情中起主导地位、对彼此的恋情坚定不移",
                    "突破难关、倾全力发挥潜能、获领导岗位、喜欢代人办事、攻克难题、担任班级或社团管理职务、全神贯注于学业",
                    "大笔开销、果断的投资、待人热情、以果断言行受到他人赞赏、因坚持不懈斗志高昂或他人敬畏",
                    "活力充沛、集体自我修复能力强、面对疾病有顽强的斗志",
                    "兼顾工作与兴趣、向往刺激的人生、活跃于社团或排队",
                },
                new string[]{ // card reversed
                    "精力不足、急躁不安、丧失信息、忍耐力不足、自私自大",
                    "对感情失去信心、面对爱情懦弱而不能坚持、渴求爱情却无功而返、经不住诱惑、彼此感情牵强",
                    "学艺不精、不能持之以恒、欲速而不达、好高骛远、向困难低头、学习不求甚解、面对学业不能持之以恒",
                    "赌博输钱、透支、不善理财、因诱惑失财，因任性妄为受他人排斥、禁不起他人诱惑、对交友失去信心",
                    "精疲力竭、因体力透支大病",
                    "说服他人、目中无人、狂妄自私、不善配合、喜独来独往、禁不住诱惑",
        });
        // card finished

        // new card
        BigAkanas[9] = new BigAkanaCard("隐士",  // card Name
                new string[]{"谨慎","内敛","内省","孤独","引导"}, // card Keywords
                Star.Virgo, // card Star
                Element.Earth, // card Element
                "这张牌代表独处，隐士试图放弃外在的诱惑，而达到内心的平静，进而在寂静的环境里通过冥想得到真理。寂静中只能听到自己内心发出的声音，所以才能够更好地理解自己的看法，寻找到一个真正属于自我的最终目标。", // card descripyion
                new string[]{ // card upright
                    "自信、理智、脚踏实地、不喜形于色、中肯的建议、坚持不懈、沉着冷静、闭门静思养精蓄锐。",
                    "暗恋、追求精神层次的结合、永久的恋情、值得信赖的对象、理性的爱恋。",
                    "努力奋斗必将成功、拟订长期计划、注重细节、杰出的分析能力、追求稳定的工作状态、获得正确的检验、勤勉、遵守规则、一板一眼。",
                    "开源节流，有自知之明、以礼待人、因内敛受人信赖、肯纳忠言。",
                    "情绪平和、天然食物有益健康。",
                    "书法、对弈、郊游、拟定计划、写日记。",
                },
                new string[]{ // card reversed
                    "沉溺和逃避是逆位隐士的主题。呆在自己的世界里只有孤寂，回到原来的世界中又不适应，或已经回不去，进退两难中，很多人选择了逃避。工作狂和网游成瘾，酗酒和药物滥用，每天十二小时坐在电视前看肥皂剧……隐士可以沉溺在一切可以由他独立操作的事物中，以便不去注意自己的颓废和孤独。沉溺是这样一种东西，时间越久就越难解救。对于耽溺者而言，勇敢面对固然是方法之一，他人的帮助在此时却也是必不可少的。",
                    "你是一个只会用金钱物质去补尝对方的伴侣，不太会去体会对方的感受，和对方培养良好的互动关系；当两人之间有意见不合的时候，你会藉着疯狂的工作来逃避和对方沟通、面对问题，因而使两人的关系渐趋恶化。",
                    "你害怕寂寞，但又不习惯和他人相处，因而常常故意让自己忙得不可开交，以免和他人有太多的时间接触，也避免自己内心的声音跑出来，告诉自己害怕孤单或是自己需要改变。 你的内心寂寞，却又不愿面对这个事实，故而不断地用工作来填满自己的社交时间，以避免和他人有太多的时间接触。工作对你而言，是一种逃避的方法，因而你常常超时工作，每天加班，甚至周末假日也在工作。",
                    "你不太会规划自己的收入，欠缺理财的正确观念，因而你常会因为乱花钱买东西，或买了品质不良的东西，遭到金钱上的损失。",
                    "你是一个工作狂，常常因为工作而导致生活饮食不正常，以致身体健康情况不好，因为工作太过劳累而引发头痛、肩膀酸痛等毛病。",
                    "多愁善感、独处、逃避、自虐、心胸狭隘、追逐小利。",
        });
        // card finished

        // new card
        BigAkanas[10] = new BigAkanaCard("命运之轮",  // card Name
                new string[]{"契机","转变","进展","运气"}, // card Keywords
                Star.Jupiter, // card Star
                Element.Fire, // card Element
                "你的命运有如那命运之轮在塔罗牌中不停的运动，时而好时而坏，这是一种公平的循环。命运之轮也会会在你喜欢的角度停下来，这使你你不可思议的好运气。它也会在你不喜欢的角度停下，你就会倒霉。不管你愿意与否，命运就是如此无情，况且生命本身就是处在不断地变化之中，这就使你的生命中充满了挑战和刺激。解牌时要抓住“命运”理解什么是“变化”，相信没有绝对的事情", // card descripyion
                new string[]{ // card upright
                    "把握时间、机会降临、转变期、意外的收获、当机立断、幸运降临、恢复原状",
                    "命运的邂逅、一见钟情、遇到新的心仪对象、突然告白",
                    "好运来临、确定前途、意外的好消息、弹性的计划、考运佳、得他人援助",
                    "临时的收入、意外之财、意外得到贵人帮助、面对世事能随机应变、社交环境有利",
                    "性情转好、疾病痊愈",
                    "摄影、绘画、受兴趣影响较大、获得机会、立即行动",
                },
                new string[]{ // card reversed
                    "判断错误、情绪低落、运气不佳、左右为难、稍安勿躁、一时的幸福、爽约",
                    "缺乏要领的交往方式、不稳定的恋情、亲事告吹、短暂的恋情、激情冷却、失恋、错失良机",
                    "竭尽全力却无功而返、效率低下、被同事或领导误解、希望落空、成绩低落",
                    "超支、上当受骗、误解较多、人际关系不稳定、竭尽全力却往往白忙一场、与友人意见不合",
                    "情绪持续低迷、病情可能恶化",
                    "暂时的好运，爽约、对事物感到乏味、生活单一无趣",
        });
        // card finished

    }
}